#Сколько единиц содержится в двоичной записи значения выражения: 42020 + 22017 – 15?
a = bin(4**2020+2**2017-15)
print(a.count('1'))
#2015
